# Python은 숫자 타입으로 정수(int), 소수(float), 복소수(complex)가 있다
# 수학에서는 복소수가 정수와 소수 모두를 포함하고 있지만,
# Python에서 복소수 타입은 '허수부가 있는 수'를 표현하기 위해서 사용한다

# -- 정수
123
0
-123
-0
# Python에서 음의 0은 없고, 이는 0으로 해석된다
9999999999999999999999999999
-9999999999999999999999999999
# Python의 int 타입은 unbounded object이므로, 별도의 최대/최소값이 없음
999_999_999
# 정수 가독성을 높이기 위해 리터럴에 언더스코어 사용 가능(50000을 50,000으로 표기하는 것과 같음)
12_3_45_6
# leading, tailing, doubly underscore가 아니라면, 자유롭게 사용 가능(_123, 123_, 12__3은 불가능)
0b1101
0o143
0xa7c
# 2진수, 8진수, 16진수

# -- 소수
1.0
1.0000
# 1.0으로 해석됨
-0.0
# 실수는 음의 0.0이 가능

42e+14
-8e+3
# 지수 표현
0e+3
# 0.0
-0e+3
# -0.0

# -- 복소수
2 + 3j
3j
# 소수부 + 허수부 또는 허수부만으로 이루어지며, imaginary number의 약자 i 대신 j를 사용
